W6D4/FirstRoutesControllers/app/controllers/artworks_controller.rb

    def create
        artwork = Artwork.new(artwork_params)
        debugger
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "'awful'"], ["image_url", "'google.com'"], ["artist_id", 6]]

    def update
        artwork = Artwork.find(params[:id])
         if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "low_class_attempt"], ["id", 6]]