W8D1/reddit_clone/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Pets"], ["description", "Pets are cool            \r\n        "], ["moderator_id", 2], ["created_at", "2020-09-14 22:23:14.282854"], ["updated_at", "2020-09-14 22:23:14.282854"]]
---
    def create
        # @sub = current_user.sub_forums.new(sub_params) ---this also works (more implicit)
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "eggs, bacon\r\n"], ["updated_at", "2020-09-14 23:49:53.790540"], ["id", 3]]
---
    def update
        @sub = Sub.find(params[:id])
        if (@sub.moderator_id == current_user.id) && @sub.update(sub_params)