W8D1/reddit_clone/RedditClone/app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_7iW-3OvzTuWvLa9mkiwZQ"], ["updated_at", "2020-09-14 19:12:41.321876"], ["id", 1]]