W6D5/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2020-01-07"], ["color", "pink"], ["description", "bad\r\n        \r\n        "], ["updated_at", "2020-09-04 23:34:25.680805"], ["id", 4]]
---
    def update
        @cat = Cat.find(params[:id])
        # debugger
        if @cat.update(cat_params)