W6D3/FirstRoutesControllers/app/controllers/users_controller.rb

    def destroy
        user = User.find(params[:id])
        # if user.destroy
        user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]