W7D2/music_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "oreo1@aa.io"], ["password_digest", "$2a$12$ZnWoBBb9heFhnZIjDbauk.h1wZAygubS5MsfA7dPp/y4J/3xDJUEW"], ["updated_at", "2020-09-09 21:20:46.769241"], ["id", 5]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
    def destroy
        @user = User.find_by(id: params[:id])
        @user.destroy